const ERROR_MSG: FwHttp.ErrorCode = {
  500: '500, 服务器异常，请稍后再试',
  502: '502, 网关异常，请稍后再试',
  503: '抱歉，当前服务器异常，请稍后再试',
  504: '服务器响应超时',

  401: '抱歉，您还未登录',
  40101: '抱歉，您还未登录',
  40102: '抱歉，您还未登录',
  40103: '抱歉，您还未登录',
  40104: '登录已过期，您需要重新登录',
  40001: '获取版本信息失败',
  403: '抱歉，您没有权限访问该页面',
  404: '抱歉，请求走丢了',
  406: '请勿重复操作',
  40601: '请勿重复操作',

  // 自定义
  10001: '解析失败，_bodyInit为非正确的JSON格式字符串',
  10002: 'request failed, 网络异常，请求失败',
  10003: '该数据为app版本发布信息，数据格式与普通的返回结果不一致',
  10004: '请求已经终止',
};

export default ERROR_MSG;
